---
layout: post
title: CCNA 2 - Managing Cisco Network
published_at: "2020-05-13"
updated_at: "2020-05-13"
author: Taners
tags: [CCNA]
---

## The boot sequence

- The power on self test (POST), stored in and runs from read-only memory (ROM)
- The bootstrap in ROM locates and loads the Cisco IOS software by executing programs responsible for finding where each IOS program is located. Once they are found, it then loads the proper files. The default order of an IOS loading from a Cisco device begins with flash, then TFTP server, and finally, ROM.
- The IOS software looks for a valid configuration file stored in NVRAM. This file is called startup-config and will be present only if an administrator has copied the running-config file into NVRAM.
- If a startup-config file is found in NVRAM, the router or switch will copy it, place it in RAM, and name the file the running-config. If a startup-config file is not in NVRAM, the router will broadcast out any interface that detects carrier detect (CD) for a TFTP host looking for a configuration. When that fails, it will start the setup mode configuration process.

## Backing Up and Restoring the Cisco Configuration

```IOS
show version
show running-config
sh start

copy running-config startup-config

! There are now so many options you can use, check
copy running-config ?

! Make a second backup
copy running-config tftp

! Restore
copy tftp running-config
! NOTE: the interfaces are shut down by default and you must manually enable each interface

! Erase
erase startup-config
reload
```

## Administration

- SW-1 to SW-3 for examples. (All is the same like this in this article)

### Setting IP Address

```IOS
SW-3(config)# interface vlan 1
SW-3(config)# no shutdown
ip address 10.100.128.8 255.255.255.0
ip default-gateway 10.100.128.1
```

### Setting Local Accounts

- Telnet

```IOS
SW-3(config)# line vty 0 15
SW-3(config-line)# login

! user-mode password only
SW-3(config-line)# password telnet
SW-3(config-line)# login
SW-3(config-line)# ^Z
```

- SSH

```IOS
SW-3(config)# hostname [hostname]
SW-3(config)# ip domain-name [domain-name]
SW-3(config)# crypto key generate rsa modulus [modulus-value]
SW-3(config)# ip ssh version 2

SW-3(config)# line vty 0 15
SW-3(config-line)# transport input ssh
SW-3(config-line)# login local
SW-3(config-line)# no password
```

### Login

- Telnet

```IOS
SW-1# telnet 10.100.128.8
! OR
SW-1# 10.100.128.8

! You won’t see console messages by default
SW-3# terminal monitor
SW-3# terminal no monitor
```

- SSH

```IOS
! SSH
SW-1# ssh -l [username] [secret]
```

### Connections and Disconnection

```IOS
! Connecting to multiple devices
SW-3> Ctrl+Shift+6
! then press X

! Check sessions
SW-1# sh sessions
! Asterisk (*)  means that was the last session connected to,
! you can return to your last session by pressing Enter twice

! Check users
SW-1#sh users

! Disconnect
SW-3>exit
SW-1#disconnect ?
SW-1#disconnect 2
```

## Banner

```IOS
! Message of the day (MOTD)
banner motd #
! Enter TEXT message. End with the character '#'
$ Acme.com network, then you must disconnect immediately.#
! This MOTD banner essentially tells anyone connecting to the device to get lost if they’re not on the guest list
banner motd x Unauthorized access prohibited! x
```

## DHCP and DNS

### Configuring DHCP

- Asign DHCP from a local DHCP server

```IOS
! Exclude the addresses you want to reserve.
Switch(config)# ip dhcp excluded-address 192.168.10.1 192.168.10.10

! Create your pool for each LAN using a unique name.
Switch(config)# ip dhcp pool Sales_Wireless

! Choose the network ID and subnet mask for the DHCP pool
Switch(dhcp-config)# network 192.168.10.0 255.255.255.0

! Add the address used for the default gateway of the subnet.
Switch(dhcp-config)# default-router 192.168.10.1

! Provide the DNS server address(es)
Switch(dhcp-config)#dns-server 4.4.4.4

! OPTIONAL:
! set the lease time in days, hours, and minutes.
! Default lease time is 24h.
Switch(dhcp-config)# lease 3 12 17

! OPTIONAL:
! set option 66, which is sending a TFTP server address to a DHCP client.
! This is typically used for VoIP phones, or auto installs, and needs to be listed as a FQDN.
Switch(dhcp-config)# option 66 ascii tftp.somewhere.com
```

- DHCP Relay: if we want to receive a DHCP address for a client from a remote server

```IOS
! configure the Fa0/0 interface of the router
! to accept the DHCP client requests (broadcast)
! and forward them to the DHCP server (unicast)
Router# config t
Router(config)# interface Fa0/0
Router(config-if)# ip helper-address 10.10.10.254
```

- Verifying DHCP

```IOS
! Lists state information about each IP address currently leased to a client.
show ip dhcp binding

! Lists the configured range of IP addresses,
! plus statistics for the number of currently leased addresses
! and the high watermark for leases from each pool.
show ip dhcp pool [poolname]

! Lists DHCP server statistics
show ip dhcp server statistics

! Check duplicate address
show ip dhcp conflict
```

### Resolving Hostnames

- If you want to use a hostname instead of an IP address to connect to a remote device, the device that you’re using to make the connection must be able to translate the hostname to an IP address.

- There are two ways to resolve hostnames to IP addresses.
  - Building a host table on each router
  - Building a Domain Name System (DNS) server, similar to creating a dynamic host table.

- Building a Host Table

```IOS
SW-1# config t

SW-1(config)# ip host SW-2 ?
<0-75537> Default telnet port number
A.B.C.D Host IP address
additional Append addresses

SW-1(config)# ip host SW-2 10.100.128.9
SW-1(config)# ip host SW-3 10.100.128.8
SW-1(config)# do sho hosts

! Try to telnet
SW-1# sw-3
SW-3> Ctrl+Shift+6
SW-1#
SW-1# sh sessions

! Remove IP host
SW-1(config)# no ip host SW-3
```

- Using DNS to Resolve Names, if you have a DNS server on your network

```IOS
SW-1# config t

SW-1(config)# ip domain-lookup
! In case of it is turned off. It is turned on by default.

! Sets the IP address of the DNS server
SW-1(config)# ip name-server 4.4.4.4

! OPTIONAL:
! the hostname will followed by domain name.
SW-1(config)# ip domain-name lammle.com
SW-1(config)# ^Z

! Try to ping, if you added SW-3 in DNS server
SW-1#ping SW-3
```

## Checking Network Connectivity and Troubleshooting

- Show IP infomation

```bash
ping  # Uses ICMP echo request and replies to test if a node IP stack is initialized and alive on the network.
traceroute | tracert # Displays the list of routers on a path to a network destination by using TTL time-outs and ICMP error messages.
arp -a | show ip arp # Displays IP-to-MAC-address mappings

ipconfig /all # shows you the PC network configuration.
ipconfig getifaddr en0 # Used to find your IP address

ifconfig # Used to get the IP address details

curl ifconfig.me # display your global Internet IP address
curl ipecho.net/plain ; echo # display your global Internet IP address
```

- Trouble shooting step by step

```bash

ping 127.0.0.1         # local host, IP stack is considered initialized
ping [self-address]    # local host IP, NIC is functioning, but cable is not considered
ping [default-gateway] # Local physical link is OK
ping [remote-server]   # Remote server is working

# If above woks, but still can't communicate with remote server, check DNS
host
dig
nslookup

traceroute
ifconfig    # work on PC
arp -a      # work on PC
show ip arp # work on Cisco IOS
```

- Debugging:
  - Debug is regarded as a very high-overhead task because it can consume a huge amount of resources and the router is forced to process-switch the packets being debugged.
  - So you don’t just use debug as a monitoring tool—it’s meant to be used for a short period of time and only as a troubleshooting tool.
  - Because the `debug all` can severely diminish the router’s performance—even render it unusable! Always best to use more specific debug commands.

```IOS
SW-1> en
SW-1# debug ?

SW-1# no debug all
! OR
SW-1# undebug all

! Open IP ICMP debugging mode
SW-1# debug ip icmp
! Try
SW-1# ping 192.168.10.17
```

- Using the `show processes` Command

```bash
SW-1# sh processes
```

- Veryfying configuration

```IOS
show ip interface
show ip interface brief
show protocols [type] [number]
show interfaces [type] [number]

show interfaces
show ip route

show interfaces trunk
show interfaces [type] [number] trunk
show interfaces switchport
show interfaces [type] [number] switchport

show controllers  # DCE/DTC cable
```
