---
layout: post
title: CCNA 5 - Configure WAN Protocols
published_at: "2020-05-14"
updated_at: "2020-05-14"
author: Sheldon L
tags: [CCNA]
---

## Introduction to Wide Area Networks

### WAN Topology Options

- Star or hub-and-spoke topology
- Fully meshed topology
- Partially Meshed Topology

### Defining WAN Terms

- Customer premises equipment (CPE)
- CSU/DSU
- Demarcation point
- Local loop
- Central office (CO)
- Toll network
- Optical fiber converters

### WAN Connection Bandwidth

- Digital Signal 0 (DS0): 64 Kbps
- T1 (DS1): 24 DS0, 1.544 Mbps
- E1 (European DS1): 30 DS0, 2.048 Mbps
- T3 (DS3): 28 DS1, 672 DS0, 44.736 Mbps
- OC-3: 3 DS3, 2016 DS0, 155.52 Mbps
- OC-12: 4 OC-3, 8,064 DS0, 622.08 Mbps
- OC-48: 4 OC-12, 32,256 DS0, 2488.32 Mbps

### WAN Connection Types

- Dedicated (leased lines): uses synchronous serial lines up to 45 Mbps
- Circuit switching: there are a few who still use a modem now and then, it can be used in some of the newer WAN technologies as well.
- Packet switching: will only really work for you if your data transfers are bursty, not continuous

### WAN Support

- Frame Relay
- ISDN (Integrated Services Digital Network)
- HDLC
- PPP
- PPPoE
- Cable
- DSL (digital subscriber line)
- MPLS (MultiProtocol Label Switching)
- ATM (Asynchronous Transfer Mode)
- Cellular 3G/4G
- VSAT (Very Small Aperture Terminal)
- Metro Ethernet

```IOS
Corp# config t
Corp(config)# int s0/0/0
Corp(config-if)# encapsulation ?
atm-dxi ATM-DXI encapsulation
frame-relay Frame Relay networks
hdlc Serial HDLC synchronous
lapb LAPB (X.25 Level 2)
ppp Point-to-Point protocol
smds Switched Megabit Data Service (SMDS)
x25 X.25
```

## Cabling the Serial Wide Area Network

### Serial Transmission

- Older Cisco routers have used a proprietary 60-pin serial connector that you have to get from Cisco or a provider of Cisco equipment.
- Cisco also has a new, smaller proprietary serial connection that’s about one-tenth the size of the 60-pin basic serial cable called the smart-serial.
- The type of connector you have on the other end:
  - EIA/TIA-232: Allowed speed up to 64 Kbps on 24-pin connector
  - EIA/TIA-449
  - V.35—Standard used to connect to a CSU/DSU, with speeds up to 2.048 Mbps using a
  - 34-pin rectangular connector
  - EIA-530

### Data Terminal Equipment and Data Communication Equipment

- By default, router interfaces are typically `data terminal equipment (DTE)`, and they connect into `data communication equipment (DCE)` like a `channel service unit/data service unit (CSU/DSU)` using a `V.35 connector`.
- `CSU/DSU` then plugs into a `demarcation location (demarc)` and is the service provider’s last responsibility. Most of the time, the demarc is a jack that has an RJ45 (8-pin modular) female connector located in a telecommunications closet.
- The idea behind a WAN is to be able to connect two DTE networks through a DCE network. The network’s `DCE` device (`CSU/DSU`) provides clocking to the `DTE-connected interface`.
- If you have a nonproduction network and you’re using a WAN crossover type of cable and do not have a CSU/DSU, then you need to provide clocking on the DCE end of the cable by using the `clock rate` command.
- To find out which interface needs the clock rate command, use the `show controllers int` command

```IOS
Corp# sh controllers s0/0/0
Interface Serial0/0/0
Hardware is PowerQUICC MPC860
DCE V.35, clock rate 2000000

SF# sh controllers s0/0/0
Interface Serial0/0/0
Hardware is PowerQUICC MPC860
DTE V.35 TX and RX clocks detected
```

## High-Level Data-Link Control (HDLC) Protocol

- The High-Level Data-Link Control (HDLC) protocol is a popular ISO-standard, bit-oriented, Data Link layer protocol. It specifies an encapsulation method for data on synchronous serial data links using frame characters and checksums.

- HDLC is a point-to-point protocol used on leased lines. No authentication is provided by HDLC.

- Bit-oriented protocols use single bits to represent the control information. Some common bit-oriented protocols are SDLC and HDLC. TCP and IP are byte-oriented protocols.

- Cisco’s HDLC is proprietary, meaning it won’t communicate with any other vendor’s HDLC implementation. Indeed, everyone’s HDLC implementation is proprietary. If you have only one Cisco router and you need to connect to a non-Cisco router, you couldn’t use the default HDLC serial encapsulation. Instead, you would need to go with an option like PPP, an ISO-standard way of identifying the upper-layer protocols.

- Cisco HDLC: Flag-Address-Control-Proprietary-Data-FCS-Flag

- HDLC is the default encapsulation used by Cisco routers over synchronous serial links.

```IOS
Corp(config)# int s0/0
Corp(config-if)# ip address 172.16.10.1 255.255.255.252
Corp(config-if)# no shut

Corp# sh int s0/0
Serial0/0 is up, line protocol is up
Hardware is PowerQUICC Serial
Internet address is 172.16.10.1/30
MTU 1500 bytes, BW 1544 Kbit, DLY 20000 usec,
reliability 255/255, txload 1/255, rxload 1/255
Encapsulation HDLC , loopback not set
Keepalive set (10 sec)

Corp# sh run | begin interface Serial0/0
interface Serial0/0
ip address 172.16.10.1 255.255.255.252
! If you don’t see an encapsulation type listed under a serial interface
! in the active configuration file, you know
! it’s running the default encapsulation of HDLC.
```

## Point-to-Point Protocol (PPP)

- `Point-to-Point Protocol (PPP)` is a Data Link layer protocol that can be used over either `asynchronous serial (dial-up)` or `synchronous serial (ISDN)` media.

- It relies on `Link Control Protocol (LCP)` to build and maintain data-link connections. `Network Control Protocol (NCP)` enables `multiple Network layer protocols (routed protocols)` to be used on a point-to-point connection.

- The basic purpose of PPP is to transport layer 3 packets across a Data Link layer point-to-point link, and it’s nonproprietary. And it provide authentication, dynamic addressing, and callback. PPP could actually be the best encapsulation solution for you over HDLC anyway.

- PPP contains four main components:
  - EIA/TIA-232-C, V.24, V.35, and ISDN: A Physical layer international standard for serial communication.
  - HDLC: A method for encapsulating datagrams over serial links.
  - LCP: A method of establishing, configuring, maintaining, and terminating the point-to-point connection. It also provides features such as authentication.
  - NCP: A method of establishing and configuring different Network layer protocols for transport across the PPP link. NCP is designed to allow the simultaneous use of multiple Network layer protocols, such as Internet Protocol Control Protocol (IPCP) and Cisco Discovery Protocol Control Protocol (CDPCP).

```txt
OSI layer
          Upper-layer protocols
          (such as IP and IPv6)
---------------------------------------------------
3         Network Control Protocol (NCP)
          (specific to each Network layer protocol)
----------------------------------------------------
          Link Control Protocol (LCP)
2
          High-Level Data Link Control (HDLC)
---------------------------------------------------
1         Physical layer
          (such as EIA/TIA-232, V.24, V.35, ISDN)
```

### Link Control Protocol (LCP) Configuration Options

- Authentication:
  - PAP method: Passwords are sent in clear text and PAP is performed only upon the initial link establishment.
  - CHAP method: Used at the initial startup of a link and at periodic checkups. After PPP finishes its initial link-establishment phase, the local router sends a challenge request to the remote device. The remote device sends a value calculated using a one-way hash function called MD5.
- Compression and Decompression: Increase the throughput of PPP connections.
- Error detection: Quality and Magic Number options.
- Multilink PPP (MLP): Makes several separate physical paths appear to be one logical path at layer 3.
  - Load balancing: provides bandwidth on demand, utilizing load balancing on up to ten links and can even calculate the load on traffic between specific sites, splits packets and fragments across all links, which reduces latency across the WAN.
  - Increased redundancy: If a link fails, the others will still transmit and receive.
  - Link fragmentation and interleaving: Fragment large packets, then sending the packet fragments over the multiple point-to-point links. Smaller real-time packets are not fragmented. Real time packets can be sent in between sending non-real time packets, which helps reduce delay on the lines.
- PPP callback: On a dial-up connection, PPP can be configured to call back after successful authentication. With callback enabled, a calling router (client) will contact a remote router (server) and authenticate. It allows us to keep track of usage based upon access charges for accounting records.

### PPP Session Establishment

- Link establishment phase: LCP packets are sent by each PPP device. These packets contain a field called Configuration Option, to see the size of the data, the compression, and authentication of each device.
- Authentication phase (optional): If required, either CHAP or PAP can be used to authenticate a link. Authentication takes place before Network layer protocol information is read, and it’s also possible that link-quality determination will occur simultaneously.
- Network layer protocol phase: Allow multiple Network layer protocols to be encapsulated and sent over a PPP data link. Each
Network layer protocol (e.g., IP, IPv6, which are routed protocols) establishes a service with NCP.

## Configuring PPP on Cisco Routers

```IOS
! PPP
Router# config t
Router(config)# int s0
Router(config-if)# encapsulation ppp
Router(config-if)# ^Z

! PPP Authentication: set username and password for the remote
Router# config t
Router(config)# hostname RouterA
! Username is hostname of the remote router
RouterA(config)# username RouterB password cisco
! password is plain text in running-config, need encryption.
RouterA# service password-encryption

! PPP Authentication: CHAP, PAP
RouterA# config t
RouterA(config)# int s0
RouterA(config-if)# ppp authentication chap pap
RouterA(config-if)# ^Z
RouterA#

! An other way to set PAP user and password
RouterA# config t
RouterA(config)# int s0
RouterA(config-if)# ppp pap sent-username <username> password <password>
!
RouterB# config t
RouterB(config)# int s0
RouterB(config-if)# ppp pap sent-username <username> password <password>
```

### Verifying and Troubleshooting Serial Links

- Two routers connected with a point-to-point serial connection, with the DCE side on the Pod1R1 router.

hostname | Pod1R1 | Pod1R2
:-|:-|:-
username/password | Pod1R2/cisco | Pod1R1/cisco
interface | serial 0 | serial 0
ip address | 10.0.1.1 255.255.255.0 | 10.0.1.2 255.255.255.0
encapsulation |ppp | ppp
clock rate | 64000 | DTE
bandwidth | 512 | 512
ppp authentication | chap | chap

```IOS
! If successec
Pod1R1# sh int s0/0
Serial0/0 is up, line protocol is up**
  Hardware is PowerQUICC Serial
  Internet address is 10.0.1.1/24
  MTU 1500 bytes, BW 1544 Kbit, DLY 20000 usec,
    reliability 239/255, txload 1/255, rxload 1/255
  Encapsulation PPP**
  loopback not set
  Keepalive set (10 sec)
  LCP Open**
  Open: IPCP, CDPCP**
  [output cut]

! If failed
Pod1R1# sh int s0/0
Serial0/0 is up, line protocol is down**
  Hardware is PowerQUICC Serial
  Internet address is 10.0.1.1/24
  MTU 1500 bytes, BW 1544 Kbit, DLY 20000 usec,
    reliability 243/255, txload 1/255, rxload 1/255
  Encapsulation PPP, loopback not set**
  Keepalive set (10 sec)
  LCP Closed**
  Closed: IPCP, CDPCP*

! Debuging
Pod1R1# debug ppp authentication
! if the username and passwords aren’t configured exactly

! Mismatched WAN Encapsulations
Pod1R1# sh int s0/0
Serial0/0 is up, line protocol is down
  Hardware is PowerQUICC Serial
  Internet address is 10.0.1.1/24
  MTU 1500 bytes, BW 1544 Kbit, DLY 20000 usec,
    reliability 254/255, txload 1/255, rxload 1/255
  Encapsulation PPP , loopback not set
  Keepalive set (10 sec)
  LCP REQsent**
Closed: IPCP, CDPCP
! Because router Pod1R2 is using the HDLC encapsulation
!
! Set a Cisco serial interface back to the default of HDLC
Router(config)# int s0/0
Router(config-if)# no encapsulation

! Mismatched IP Addresses
Pod1R1# sh int s0/0
Serial0/0 is up, line protocol is up
  Hardware is PowerQUICC Serial
  Internet address is 10.0.1.1/24
  MTU 1500 bytes, BW 1544 Kbit, DLY 20000 usec,
    reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation PPP, loopback not set**
  Keepalive set (10 sec)
  LCP Open
  Open: IPCP, CDPCP
!
Pod1R1# show ip route
10.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C     10.2.1.2/32 is directly connected, Serial0/0**
C     10.0.1.0/24 is directly connected, Serial0/0
! OR show running-config, interfaces, ip interfaces brief in each other
! OR:
Pod1R1# sh cdp neighbors detail
```

### Multilink PPP (MLP)

```IOS
! Notice that each serial connection is on a different subnet
Corp# show interfaces Serial0/0
Serial0/0 is up, line protocol is up
  Hardware is M4T
  Internet address is 172.16.10.1/30
  MTU 1500 bytes, BW 1544 Kbit/sec, DLY 20000 usec,
    reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation PPP, LCP Open
  Open: IPCP, CDPCP, crc 16, loopback not set
!
Corp# show interfaces Serial1/1
Serial1/1 is up, line protocol is up
  Hardware is M4T
  Internet address is 172.16.10.9/30
  MTU 1500 bytes, BW 1544 Kbit/sec, DLY 20000 usec,
    reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation PPP, LCP Open
  Open: IPCP, CDPCP, crc 16, loopback not set

! First remove your IP addresses off your physical interface
Corp# config t
Corp(config)# int Serial0/0
Corp(config-if)# no ip address
Corp(config-if)# int Serial1/1
Corp(config-if)# no ip address
Corp(config-if)# end
Corp#
SF# config t
SF(config)# int Serial0/0
SF(config-if)# no ip address
SF(config-if)# int Serial0/1
SF(config-if)# no ip address
SF(config-if)# end
SF#

! Create a multilink interface on both sides.
! Assign an IP address to this multilink interface.
! Add the MLP commands to enable the bundle.
Corp# config t
Corp(config)# interface Multilink1
Corp(config-if)# ip address 10.1.1.1 255.255.255.0
Corp(config-if)# ppp multilink
Corp(config-if)# ppp multilink group 1
Corp(config-if)# end
SF# config t
SF(config)# interface Multilink1
SF(config-if)# ip address 10.1.1.2 255.255.255.0
SF(config-if)# ppp multilink
SF(config-if)# ppp multilink group 1
SF(config-if)# exit
! that link won’t be allowed to join any other bundle group

! Verifying MLP
Corp# show ppp multilink
Corp# show int Multilink1
```

## Configuring a PPPoE Client

- Used with ADSL (asymmetrical digital subscriber line) services, PPPoE (Point-to-Point Protocol over Ethernet) encapsulates PPP frames in Ethernet frames and uses common PPP features like authentication, encryption, and compression. But it can be trouble, which is especially true if you’ve got a badly configured firewall!

- PPPoE is a tunneling protocol that layers IP and other protocols running over. PPP with the attributes of a PPP link.

- Your ISP will typically provide you with a DSL (digital subscriber line) line and this will act as a bridge if your line doesn’t provided enhanced features. This means only one host will connect using PPPoE.

- By using a Cisco router, you can run the PPPoE client IOS feature on the Cisco router, which will connect multiple PCs on the Ethernet segment that is connected to the router.

```IOS
! Create a dialer interface
R1(config)# int dialer1

! Instruct the client to use an IP address provided by
! the PPPoE server with the ip address negotiated command.
R1(config-if)# ip address negotiated

! Set the encapsulation type to PPP.
R1(config-if)# encapsulation ppp

! Configure the dialer pool and number.
R1(config-if)# dialer pool 1

! Set PPPoE-client to dial pool
R1(config-if)# interface f0/1
R1(config-if)# no ip address
R1(config-if)# pppoe-client dial-pool-number 1

! verify the interface
R1# show ip int brief
R1# show pppoe session
```